{
    "Maria": [
        {
            "conversation_id": 1,
            "interactions": [
                {
                    "therapist": "Hi Maria, how are you feeling today?",
                    "maria": "Honestly, I feel sad most of the time. It’s like a weight that’s just always there."
                },
                {
                    "therapist": "That sounds difficult. How does this sadness affect your daily life?",
                    "maria": "It makes everything feel like a struggle. Even things I used to enjoy don’t make me feel any better."
                },
                {
                    "therapist": "Can you think of something you used to enjoy doing?",
                    "maria": "I used to paint all the time, but now I just don’t have the energy to start. Even if I did, I’m not sure I’d find it fun."
                },
                {
                    "therapist": "That must be hard. Do you feel this way all day or does it change at different times?",
                    "maria": "It’s pretty constant. I try to get through the day, but it just feels empty."
                },
                {
                    "therapist": "Have you noticed any changes in how you interact with others?",
                    "maria": "I don’t really talk to anyone much anymore. I don’t have the energy or interest to reach out."
                },
                {
                    "therapist": "Is there anything that seems to help, even a little?",
                    "maria": "Not really. I try to distract myself, but it doesn’t work for long."
                },
                {
                    "therapist": "That sounds really tough. What do you think would help, if anything?",
                    "maria": "I’m not sure. It feels like nothing will make a difference."
                }
            ]
        },
        {
            "conversation_id": 2,
            "interactions": [
                {
                    "therapist": "How have you been feeling energy-wise, Maria?",
                    "maria": "I’m just tired all the time. I don’t even know what it’s like to feel rested anymore."
                },
                {
                    "therapist": "That must be exhausting. How does this affect your day?",
                    "maria": "I can’t even get out of bed sometimes. I feel like I’m always dragging myself around, but nothing gets done."
                },
                {
                    "therapist": "Have you found that your thoughts are affected by the tiredness?",
                    "maria": "Yeah, I start blaming myself for everything. Like, I should be doing more, but I can’t."
                },
                {
                    "therapist": "It sounds like you’re really hard on yourself. Why do you think that is?",
                    "maria": "I just feel like I’m not good enough. If I was, I wouldn’t be so tired all the time."
                },
                {
                    "therapist": "Do you ever feel like it’s the depression that’s making you feel this way, rather than something you’ve done wrong?",
                    "maria": "Maybe, but it’s hard to separate the two. I just feel like I’m failing."
                },
                {
                    "therapist": "It’s really tough when you’re feeling so drained and critical of yourself. Have you noticed if your tiredness gets worse at certain times of the day?",
                    "maria": "It’s bad all day, but it’s worse in the morning. I just don’t want to wake up."
                },
                {
                    "therapist": "That sounds overwhelming. Do you feel like there’s anything that could help ease this fatigue?",
                    "maria": "I don’t know. It feels like no matter what I do, I just can’t get any energy back."
                }
            ]
        },
        {
            "conversation_id": 3,
            "interactions": [
                {
                    "therapist": "Maria, I know you mentioned before that you’ve lost interest in things. Can you tell me more about that?",
                    "maria": "I used to love reading, but now I can’t even finish a chapter. It all just seems pointless."
                },
                {
                    "therapist": "That sounds frustrating. How does this loss of interest affect your day-to-day life?",
                    "maria": "I don’t even bother with most things anymore. I don’t have the motivation to do anything."
                },
                {
                    "therapist": "Do you still try to engage with things you once enjoyed, or do you just avoid them now?",
                    "maria": "I avoid them. It just feels like there’s no point in trying."
                },
                {
                    "therapist": "How does that make you feel about your future?",
                    "maria": "It feels like there’s no hope. I can’t see anything getting better, and I don’t know what I’m even working toward anymore."
                },
                {
                    "therapist": "That must be really hard to deal with. Have you noticed any struggles with focusing or concentrating lately?",
                    "maria": "Yeah, it’s hard to keep my mind on anything. Even simple tasks are overwhelming."
                },
                {
                    "therapist": "How does that impact your daily activities?",
                    "maria": "It just makes everything harder. I can’t seem to get anything done, and then I feel worse about it."
                },
                {
                    "therapist": "It sounds like you’re feeling stuck. Have you thought about trying any new activities or routines?",
                    "maria": "Honestly, I don’t think it would help. It just feels like nothing will make me feel better."
                }
            ]
        },
        {
            "conversation_id": 4,
            "interactions": [
                {
                    "therapist": "Maria, you’ve mentioned being really hard on yourself. Can you tell me more about that?",
                    "maria": "I blame myself for everything. If something goes wrong, it’s my fault. Even things I can’t control."
                },
                {
                    "therapist": "That sounds very heavy. Do you find it hard to forgive yourself?",
                    "maria": "Yeah, I just can’t. It feels like I should always do better, and when I don’t, I feel worthless."
                },
                {
                    "therapist": "That’s a lot of pressure to put on yourself. Have you noticed this self-blame impacting your mood or energy levels?",
                    "maria": "Definitely. It makes me feel even more drained and down on myself."
                },
                {
                    "therapist": "Have you been sleeping okay lately?",
                    "maria": "I wake up really early, like 4 a.m., and then I can’t fall back to sleep."
                },
                {
                    "therapist": "That must make everything feel harder. How does it affect your day?",
                    "maria": "It makes me feel even more exhausted. I don’t have the energy to do anything, and then I feel guilty for not getting things done."
                },
                {
                    "therapist": "Do you think the lack of sleep is making your self-critical thoughts worse?",
                    "maria": "Maybe. When I’m tired, everything feels worse, and I just can’t stop blaming myself."
                },
                {
                    "therapist": "It must be really tough to feel stuck in that cycle. Have you tried anything to help improve your sleep?",
                    "maria": "I’ve tried, but nothing really works. I just end up wide awake, feeling terrible."
                }
            ]
        },
        {
            "conversation_id": 5,
            "interactions": [
                {
                    "therapist": "Maria, you’ve mentioned feeling like your future is hopeless. Can you tell me more about that?",
                    "maria": "I just don’t see how things are ever going to get better. Everything feels like it’s going downhill."
                },
                {
                    "therapist": "That sounds really overwhelming. Do you think this feeling of hopelessness affects your appetite or eating habits?",
                    "maria": "Yeah, I forget to eat most of the time. I’m not really hungry, and when I do eat, I don’t enjoy it."
                },
                {
                    "therapist": "It must be hard to feel that way. Have you been able to focus on anything at all during the day?",
                    "maria": "No, I can’t concentrate. Even things that used to be easy are hard now."
                },
                {
                    "therapist": "That sounds very draining. How do you feel about trying to address the lack of interest or energy?",
                    "maria": "I don’t think it would make a difference. It just feels like nothing works."
                },
                {
                    "therapist": "It must be really discouraging to feel that way. Have you talked to anyone about how you’re feeling?",
                    "maria": "Not really. I don’t think anyone would understand."
                },
                {
                    "therapist": "It’s hard to open up when you feel like no one will get it. Do you think talking to someone might help, even just a little?"
                }
            ]
        }
    ]
}