{
    "Noah": [
        {
            "conversation_id": 1,
            "interactions": [
                {
                    "therapist": "Hi Noah, how have you been feeling about yourself lately?",
                    "noah": "I think I am doing okay, but sometimes I feel like I am not doing as well as I should be."
                },
                {
                    "therapist": "That sounds frustrating. Do you feel that way in specific areas of your life, or is it more general?",
                    "noah": "Mostly at work. I look at others who seem to be advancing faster, and it makes me wonder if I am falling behind."
                },
                {
                    "therapist": "Have you spoken with anyone at work about how you are doing?",
                    "noah": "Not really. I figure it is just something I need to handle on my own."
                },
                {
                    "therapist": "That makes sense, but feedback from colleagues or supervisors could give you a clearer picture. Would that help?",
                    "noah": "Maybe. I think I am just too hard on myself sometimes."
                },
                {
                    "therapist": "It is easy to be self-critical, especially when you compare yourself to others. What do you think you are doing well right now?",
                    "noah": "I think I have been staying organised and meeting deadlines, even when it feels challenging."
                },
                {
                    "therapist": "That is excellent. Recognising those successes can help balance out the self-doubt. Could you take a moment each day to note something you are proud of?",
                    "noah": "I can try that. It might help me focus on the positives more."
                }
            ]
        },
        {
            "conversation_id": 2,
            "interactions": [
                {
                    "therapist": "How have you been managing your daily tasks, Noah?",
                    "noah": "It is fine once I get started, but getting started is harder than it used to be."
                },
                {
                    "therapist": "Is it certain types of tasks, or does it depend on how you are feeling?",
                    "noah": "Mostly work-related things, but even hobbies sometimes feel like a chore."
                },
                {
                    "therapist": "That sounds frustrating. What do you usually do to push past that initial hurdle?",
                    "noah": "I tell myself to just start small, like doing one little thing first."
                },
                {
                    "therapist": "That is a great approach. Do you feel that works most of the time?",
                    "noah": "It does, but on some days, I still feel like I am dragging my feet."
                },
                {
                    "therapist": "On those harder days, do you find it helps to plan breaks or reward yourself for completing tasks?",
                    "noah": "I have not tried that much. I usually just keep going until I am done."
                },
                {
                    "therapist": "Taking intentional breaks or giving yourself a small reward might make it feel less draining. Would you be open to trying that?",
                    "noah": "Sure, I can give it a shot."
                },
                {
                    "therapist": "Let us see if that helps make starting and finishing tasks feel a bit easier this week."
                }
            ]
        },
        {
            "conversation_id": 3,
            "interactions": [
                {
                    "therapist": "You mentioned feeling more annoyed by small things lately. Can you give me an example?",
                    "noah": "Yeah, things like people interrupting me when I am working really get on my nerves."
                },
                {
                    "therapist": "How do you handle those moments when they come up?",
                    "noah": "I usually just take a deep breath and move on. I do not want to make a big deal out of it."
                },
                {
                    "therapist": "That sounds like a helpful strategy. Does the feeling linger, or does it pass quickly?",
                    "noah": "It passes quickly, but I feel bad for getting annoyed in the first place."
                },
                {
                    "therapist": "Feeling guilty about those moments can add extra stress. Could reminding yourself that it is a normal reaction help ease that guilt?",
                    "noah": "Maybe. I guess everyone gets annoyed sometimes."
                },
                {
                    "therapist": "Exactly. And recognising that can make it easier to let go of the irritation. Do you think taking short breaks during the day might help as well?",
                    "noah": "Probably. I do not take many breaks, so that might help me reset."
                },
                {
                    "therapist": "Let us try adding a short break when you notice irritation building up. It might help you feel more in control."
                }
            ]
        },
        {
            "conversation_id": 4,
            "interactions": [
                {
                    "therapist": "How has your sleep been recently, Noah?",
                    "noah": "It is mostly fine, but sometimes I wake up feeling tired even after a full night’s sleep."
                },
                {
                    "therapist": "Do you notice this happens more often when you are feeling stressed or overwhelmed?",
                    "noah": "Yes, especially if I have had a busy day or if something is on my mind."
                },
                {
                    "therapist": "Have you tried adjusting your evening routine to help you unwind?",
                    "noah": "Not really. I usually just scroll through my phone until I fall asleep."
                },
                {
                    "therapist": "Using your phone before bed can sometimes make it harder to get restful sleep. Would you consider reducing screen time before bed?",
                    "noah": "I could try that. Maybe I could read a book instead."
                },
                {
                    "therapist": "That is a great idea. How about starting with 15 minutes of reading instead of screen time before bed?",
                    "noah": "That sounds manageable. I will give it a try."
                },
                {
                    "therapist": "Let us see how that affects how you feel in the mornings."
                }
            ]
        },
        {
            "conversation_id": 5,
            "interactions": [
                {
                    "therapist": "What has been going well for you this past week, Noah?",
                    "noah": "I have been staying on top of things at work and helping out more at home, which feels good."
                },
                {
                    "therapist": "That is excellent. Do you feel that recognising these successes helps with your self-doubt?",
                    "noah": "A little, but I still catch myself focusing on what I could be doing better."
                },
                {
                    "therapist": "That is a common pattern. What do you think triggers those thoughts?",
                    "noah": "Comparing myself to others, mostly. I see friends achieving big things, and I feel like I should be doing more."
                },
                {
                    "therapist": "Comparisons can be tough. What would it feel like to focus more on your personal goals rather than others’ achievements?",
                    "noah": "It would probably take some pressure off. I just need to remind myself to do that."
                },
                {
                    "therapist": "What if you set a goal to write down one personal accomplishment each day? Would that help you stay focused on your own progress?",
                    "noah": "That could work. It would help me see what I am actually doing right."
                },
                {
                    "therapist": "Exactly. Let us make that a small goal for the week and see how it feels."
                }
            ]
        }
    ]
}